/*
    [실습1] * 제출용
    문제1: 아래와 같이 이스케이프 문자를 이용하여 콘솔에 출력하는 코드를 작성하시오.
			|\_/|
			|q p|   /}
			( 0 )"""\
			|"^"`    |
			||_/=\\__|

    문제2: 자신의 이름, 나이, 키, 좌우명 을 저장하는 변수를 각각 선언하고,
            아래 <출력 예시>와 똑같이 콘솔에 출력하는 코드를 작성하시오.
        <요구 조건>:
            변수 선언 및 초기화
                이름은 String 타입의 변수 name에 리터럴로 저장하세요.
                나이는 int 타입의 변수 age에 리터럴로 저장하세요.
                키는 double 타입의 변수 height에 리터럴로 저장하세요.
                좌우명은 String 타입의 변수 motto에 리터럴로 저장하세요.
            출력 형식
                System.out.printf() 함수를 반드시 사용해야 합니다.
                서식 지정자(%s, %d, %f)를 사용하여 변수 값을 출력에 포함시키세요.
                키는 소수점 첫째 자리까지만 표시하세요. (예: 175.5)
                좌우명은 큰따옴표(")로 감싸서 출력해야 하며, 이를 위해 이스케이프 문자를 사용해야 합니다.
                전체 출력 내용은 한 줄의 printf 문으로 완성해야 합니다.
        <출력 예시 : []안에는 리터럴이 저장된 변수값을 출력합니다. >
            제 이름은 [본인이름], 나이는 [본인나이]세, 키는 [본인키]cm 입니다.
            저의 좌우명은 "[본인좌우명]" 입니다.

*/
package day02_월;

public class 실습2 {

    public static void main(String[] args) { // main start

        // 자바 과제1 : JS day10 연산자 문제 8개 (1_연산자.js) 를 자바로 풀이하기
        // 제출 방법 : 강의 카카오톡방에 풀이한 코드가 위치한 상세 git 주소 제출

        // 입력 방법 : prompt() 대신에 Scanner scan = new Scanner(System.in);  scan.nextXXX();
        // 출력 방법 : console.log() 대신에 System.out.println();
        // IF조건문 문법 없이 풀이

        // [지문1] 국어 , 영어 , 수학 점수를 각 입력받아서 각 변수에 저장하고 총점 과 평균을 계산하여 console탭에 출력하시오.

        // [지문2] 반지름를 입력받아서 원넓이[반지름*반지름*3.14] 계산하여 console탭에 출력하시오.

        // [지문3] 두 실수를 입력받아서 앞 실수의 값이 뒤실수의 값의 비율% 계산하여 console탭에 출력하시오.

        // [지문4] 정수를 입력받아 입력받은 값이 홀수이면 true / 짝수이면 false 로 console탭에 출력하시오.

        // [지문5] 정수를 입력받아 입력받은 값이 7의 배수이면 true / 아니면 false 로 console탭에 출력하시오.

        // [지문6] 정수를 입력받아 입력받은 값이 홀수 이면서 7배수 이면 true / 아니면 false 로 console탭에 출력하시오.

        // [지문7] 십만원 단위의 금액을 입력받아 입력받은 금액의 지폐수를 console탭에 출력하시오.
        // -> 입력 예] 356789 입력시 , 출력 예] 십만원:3장 만원:5장 천원6장

        // [지문8] 1차점수 와 2차점수 각각 입력받아서
        // -> 총점이 150점이상이면 '합격' 아니면 '불합격' 으로 console탭에 출력하시오.



    } // main end

}


