/*
    [실습1] * 제출용
    문제1: 아래와 같이 이스케이프 문자를 이용하여 콘솔에 출력하는 코드를 작성하시오.
			|\_/|
			|q p|   /}
			( 0 )"""\
			|"^"`    |
			||_/=\\__|

    문제2: 자신의 이름, 나이, 키, 좌우명 을 저장하는 변수를 각각 선언하고,
            아래 <출력 예시>와 똑같이 콘솔에 출력하는 코드를 작성하시오.
        <요구 조건>:
            변수 선언 및 초기화
                이름은 String 타입의 변수 name에 리터럴로 저장하세요.
                나이는 int 타입의 변수 age에 리터럴로 저장하세요.
                키는 double 타입의 변수 height에 리터럴로 저장하세요.
                좌우명은 String 타입의 변수 motto에 리터럴로 저장하세요.
            출력 형식
                System.out.printf() 함수를 반드시 사용해야 합니다.
                서식 지정자(%s, %d, %f)를 사용하여 변수 값을 출력에 포함시키세요.
                키는 소수점 첫째 자리까지만 표시하세요. (예: 175.5)
                좌우명은 큰따옴표(")로 감싸서 출력해야 하며, 이를 위해 이스케이프 문자를 사용해야 합니다.
                전체 출력 내용은 한 줄의 printf 문으로 완성해야 합니다.
        <출력 예시 : []안에는 리터럴이 저장된 변수값을 출력합니다. >
            제 이름은 [본인이름], 나이는 [본인나이]세, 키는 [본인키]cm 입니다.
            저의 좌우명은 "[본인좌우명]" 입니다.

*/
package day02_월;

public class 실습2 {

    public static void main(String[] args) {}
}


